Revit 2027 API
RebarUpdateCurvesData.HostMirrored Property
 If true, then host of the rebar was mirrorred (along with the rebar) before this regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HostMirrored { get; set; }
Public Property HostMirrored As Boolean
	Get
	Set
public:
property bool HostMirrored {
	bool get ();
	void set (bool value);
}
member HostMirrored : bool with get, set
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace